Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: བརྟན་པ འི་ བློ་གྲོས་ ཕྱི་མ འི་ ཚེ་ ཕྱི་མ འི་ དུས་ ལྔ་ བརྒྱ་པ་ ཐ་མ་ ལ་ བབ་པ་ ན །_ |#| གང་ ལས་ ཏིང་ངེ་འཛིན་ དེ་ ཐོབ་པ འི་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ ནི་ ཏིང་ངེ་འཛིན་ དེས་ ངེས་པ ར་ འབྱུང་བ་ ཡིན་ ཞིང་ །_ དགེ་སློང་ དེ འི་ སྤོབས་ པ་ མཐའ་ཡས་པ་ ཡིན་པ ར་ དེ འི་ མཐའ་ ཁོང་ དུ་ ཆུད་པ ར་ བྱ འོ །_།
en: $1944 “Dṛḍhamati,” |#| “you should understand that, in the future, during the time of the final five hundred years, the bodhisattvas who have learned of that meditative absorption will reach perfection through that absorption and its limit will be the infinite eloquence of those monks.#89

source: བརྟན་པ འི་ བློ་གྲོས་ གང་ ཁྱོད་ འདི་སྐད་ དུ་ སེམས་ཅན་ གང་དག་ ཏིང་ངེ་འཛིན་ དེས་ ངེས་པ ར་ འབྱུང་བ ར་ འགྱུར་བ་ དེ་དག་ ཇི་སྙེད་ ཅིག་ འབྱུང་བ ར་ འགྱུར་ ཞེས་ ཟེར་བ་ ནི་ བརྟན་པ འི་ བློ་གྲོས་ གང་དག་ ཏིང་ངེ་འཛིན་ དེ་ ལ་ སྒོམ་པ ར་ བྱེད་ ཅིང་ །_ ཡིད་ གཞན་ དུ་ མི་ སེམས་ ལ་ ལན་ མང་ དུ་ བྱེད་པ་ དེ་དག་ ནི་ ཏིང་ངེ་འཛིན་ དེས་ ངེས་པ ར་ འབྱུང་བ ར་ འགྱུར་ ཞིང་ །_ སྤོབས་པ་ མཐའ་ཡས་པ་ ཡང་ ཐོབ་པ ར་ འགྱུར་ ལ །_ དེ་བཞིན་ གཤེགས་པ་ མི་ འཁྲུགས་པ་ ལས་ སྤོབས་པ་ མཐའ་ཡས་པ་ ཉིད་ དུ་ བྱ་བ འི་ ཕྱིར་ ཆོས་ ཀྱི་ སྒོ་ སྟོང་ བརྒྱད་ བརྒྱ་ ཐོབ་པ ར་ འགྱུར་ ཏེ
en: Dṛḍhamati, regarding your statement, ‘There will appear myriad beings who will reach perfection through that absorption,’ Dṛḍhamati, those who cultivate that absorption, repeating it frequently without thinking about anything else, will reach perfection through that absorption and also attain infinite eloquence, attaining eight hundred thousand gateways of Dharma from the thus-gone one Akṣobhya in order to actualize that infinity of eloquence.

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ ནི་ སྒོ་ གཅིག་ ཏུ་ མཚམས་ སྦྱོར་བ འི་ ཚིག་ ཡིན་ ནོ །_།
en: Hence, Dṛḍhamati, these are expressions connected to one gateway.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཀྱི་ སྒོ་ དེ་དག་ ཐམས་ཅད་པོ་ འདི་ ནི་ རིམ་པ ར་ ཕྱེ་བ འི་ ཚིག་ ཡིན་ ནོ །_།
en: Dṛḍhamati, the gateways of Dharma in their entirety are expressions that distinguish between the levels.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ལྟ་བས་ན་ སྒོ་ ནི་ ཅི་ ནས་ ཁོང་ དུ་ ཆུད་པ ར་ བྱ་བ་ ཡིན །_
en: This is why, Dṛḍhamati, that gateway should by all means be comprehended.

source: ཅི་ ནས་ འཇུག་པ ར་ བྱ་བ་ ཡིན །_
en: It should by all means be entered.

source: ཅི་ ནས་ བསྒོམ་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: It should by all means be cultivated.

source: དེ་ མཚན་མ ར་ བྱས་ ནས་ དེ་ ཡོངས་སུ་ འཆད་པ་ ནི་ རྟག་ ཏུ་ བསྒོམ་པ ར་ བྱ་བ འོ །_།
en: Explaining it based on its characteristics should be cultivated constantly.

source: དེ་བཞིན་ དུ་ དམིགས་པ་ དག་ ཀྱང་ བསྒོམ་པ ར་ བྱ་བ་ ཡིན་ ཏེ །_
en: Apprehending it, moreover, should likewise be cultivated.

source: ལས་ གཅིག་པོ་ འདི་ ནི་ སངས་རྒྱས་ ཀྱི་ སྐུ་ ཡིན་ ནོ །_།
en: This singular action is the body of the Buddha.

source: སངས་རྒྱས་ བྱང་ཆུབ་ དེ་ ནི་ སེམས་ ཀྱིས་ བརྟགས །_།
en: $1945 “The awakening of the buddhas is imagined by mind.

source: སེམས་ ཀྱང་ གཟུགས་ མེད་ རང་བཞིན་ རྣམ་པར་ དག _།
en: Mind too is formless and pure by nature.

source: དམིགས་པ་ རྣམས་ ཀྱིས་ རྒྱ་ ཆེ ར་ གང་ གནས་པ །_། དམིགས་པ་ གཞན་ དང་ གཞན་ ལ་ འཇུག་པ ར་ འགྱུར །_།
en: Those who adhere extensively to apprehending Will engage in each and every apprehension.

source: སེམས་ ཀྱི་ ཡོངས་གཅོད་ སོ་སོ ར་ ཤེས་ ནས་ སུ །_།
en: $1946 “Having discerned the parameters of mind,

source: དེ་བཞིན་ དམིགས་ ལ འང་ ཆོས་ འདི་ ཐམས་ཅད་ ནི །_། རྣམ་པར་ རྟོག་ ལས་ བྱུང་བ་ ཡིན་པ ར་ ཤེས །_།
en: They will know, with regard to apprehending, that all these phenomena Have likewise emerged from thought—

source: གང་ དུ་ རྟོག་ མི་ སྐྱེ་བ་ དེ་ སྒོ་ ཡིན །_།
en: Wherever no thoughts arise is a gateway.

source: སེམས་ ཀྱི་ འགྱུར་བ འི་ རང་བཞིན་ ཤེས་པ ར་ འགྱུར །_།
en: $1947 “They will know the changing nature of mind, And

source: དེ་བཞིན་ དམིགས་པ་ ཉིད་ ཀྱང་ ཤེས་པ ར་ འགྱུར །_།
en: they will likewise know apprehending itself.

source: འགྲོ་བ་ འདི་ ཀུན་ གསོབ་ ཏུ་ རབ་ཏུ་ ཤེས །_།
en: They will perfectly know that all these beings are essenceless, And

source: རབ་ཏུ་ ཤེས་པ ས་ དྲན་པ་ རྨོངས་ མི་ འགྱུར །_།
en: through perfectly knowing that, their mindfulness will not be obscured.

source: དེ་ལྟ ར་ ཆོས་ དེ་ རབ་ཏུ་ ཤེས་པ ས་ ན །_།
en: $1948 “Through thus perfectly knowing the Dharma,

source: དེ་ ནི་ སངས་རྒྱས་ སྐུ་ མང་ སྤྲུལ་པ ར་ བྱེད །_།
en: They will emanate many buddha bodies.

source: དེ་ ནི་ སྐུ་ ལ འང་ ཅུང་ཟད་ ཆགས་ མི་ འགྱུར །_། |#| དེ་བཞིན་ དེ་ ནི་ [222a] འགྲོ་བ་ སྟོང་པ ར་ ཤེས །_།
en: They will not be attached in the slightest to those bodies, And will likewise know beings to be empty. [222.a]

source: དམིགས་པ་ ཡི་ ནི་ མཚན་མ་ བཟུང་ ནས་ སུ །_། སེམས་ དང་ ལུས་ ཀྱི་ འགྱུར་བ་ མཐོང་བ ར་ འགྱུར །_།
en: $1949 “Grasping the characteristics of apprehending, They will witness the transformations of mind and body.

source: དེ་ཕྱིར་ ཏིང་འཛིན་ དེ་ ནི་ མྱུར་ བསྒོམས་པ ས །_།
en: Therefore, by urgently cultivating that absorption,

source: དེ་ ཡི་ ཤེས་པ་ དེ་ལྟ ར་ ཆོས་ ལ་ ཞུགས །_།
en: Their knowledge will thus partake of the Dharma.

source: ཆོས་ བསྟན་པ་ ཡིས་ རྣམ་པར་ འཕྲུལ་བ ར་ འགྱུར །_།
en: $1950 “In teaching the Dharma, they will manifest forms.

source: ཆོས་ བསྟན་ ཚེ་ ན་ ནམ་ཡང་ རྨོངས་ མི་ འགྱུར །_།
en: When teaching the Dharma, they will not be deluded.

source: མི་ རྣམས་ ཀྱི་ ནི་ དགེ་ བ་ བསྐྱེད་པ ར་ འགྱུར །_། |#| རིང་པོ་ མི་ ཐོགས་ ཆོས་ དེ འང་ ཐོབ་པ ར་ འགྱུར །_།
en: They will develop virtue in people, Who will also obtain the Dharma before long.”

source: སྒོ འི་ ཚིག་ མངོན་པར་ སྒྲུབ་པ འི་ ལེའུ་ སྟེ་ བཅུ་གསུམ་པ འོ །།_།།
en: $1951 This concludes the thirteenth chapter.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ བཞི་ དང་ ལྡན་ ན །_
en: $1952 “Dṛḍhamati, if you have four qualities,

source: ཏིང་ངེ་འཛིན་ དེ་ སྒྲུབ་པ་ དང་ གཞན་དག་ ལ་ བསྟན་པ ར་ ནུས་ ཏེ །_
en: they will enable you to accomplish that absorption and teach it to others.

source: ཏིང་ངེ་འཛིན་ དེ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ བརྩོན་འགྲུས་ བརྩམས་ པ་ ཡིན་ ཞིང་ བརྩོན་པ་ མི་ གཏོང་བ་ ཡང་ ཡིན །_
en: Apply diligence to attain that absorption and do not discard your efforts.

source: ཉིན་མཚན་ ཉིད་ དུ་ འཆག་པ་ ལྷུར་ལེན་ པས་ འདུག་པ་ ན་ བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ་ མཆོག་ ན་ བཞུགས་པ འམ །_ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ འི་ དེ་བཞིན་ གཤེགས་པ་ དེ་དག་ མངོན་དུ་ བྱེད་ ཅིང་ ཆོས་ ལ་ སེར་སྣ་ ཡང་ མེད་པ་ ཡིན །_
en: When seated, enthusiastically preaching day and night, manifest the thus-gone ones seated at the supreme seat of awakening, or turning the wheel of Dharma, and likewise have no stinginess with Dharma.

source: ཆོས་ ཀྱི་ སྦྱིན་པ་ ཡང་ སྦྱིན་པ ར་ བྱེད་ ཅིང་ བདག་ཉིད་ དང་ ཆོས་ ཉན་པ་ དེ་ དག་ དེ་བཞིན་ གཤེགས་པ འི་ སྐུ་ དག་ ཏུ་ བྱིན་ གྱིས་ རློབ་པ ར་ བྱེད་ ལ་
en: While giving the gift of Dharma, transform yourself and the audience members for the Dharma into the bodies of thus-one ones;

source: རང་ གི་ ལུས་ རྣམ་པར་ འཇིག་པ ར་ བྱེད་ ཀྱང་ །_ གང་ ལ་ ཡང་ མི་ གནས་པ་ ཡིན་ ཞིང་ མི་ གནས་ བཞིན་ དུ་ ཆོས་སྟོན་ པར་ བྱེད་པ་ ཡིན །_
en: for while one’s own body will be destroyed, those bodies do not abide anywhere at all, and teach the Dharma while not abiding anywhere.

source: དེ་ གནས་པ་ དེ་ལྟ་ བུ་ དང་ སྤྱོད་ཡུལ་ དེ་ལྟ་ བུ་ དང་ །_ བྱིན་ གྱི་ རླབས་ དེ་ལྟ་ བུར་ བྱས་ ནས་ |#| སྟན་ དེ་ ལ་ འདུག་པ ར་ བྱེད་ ཅིང་ །_ འདུག་ ནས་ |#| ཀྱང་ ཆོས་ ཀྱི་ སྦྱིན་པ་ སྦྱིན་པ ར་ བྱེད་པ་ ཡིན་ ཏེ
en: One should sit on the cushion observing that, with that kind of experience, and effecting that kind of transformation, and while seated in this manner, one should give the gift of Dharma.

source: དེ་ ཏིང་ངེ་འཛིན་ དེ་ ཐོབ་པ ར་ འགྱུར་ རོ །_།
en: $1953 “One will thus attain that absorption,

source: བརྟན་པ འི་ བློ་གྲོས་ ཁ་ཅིག་ གིས་ ནི་ ཆོས་ ཀྱི་ སྦྱིན་པ་ སྦྱིན་པ ར་ བྱེད་པ་ ན་ ཐོབ་པ ར་ འགྱུར་ རོ །_།
en: Dṛḍhamati. |#| Some will attain it while giving the gift of Dharma.

source: ཁ་ཅིག་ གིས་ ནི་ ཕྱིས་ སོ །_།
en: For some it will be afterward.

source: ཁ་ཅིག་ གིས་ ནི་ རྩོམ་པ འི་ ཚེ འོ །_།
en: For some it will be while composing.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ གཞན་ བཞི་ དང་ ལྡན་པ ས་ ཏིང་ངེ་འཛིན་ དེ་ ལ་ སྦྱོར་བ ར་ བྱ་ སྟེ །_
en: $1954 “Dṛḍhamati, one should connect with that absorption by having four other qualities.

source: བརྟན་པ འི་ བློ་ གྲོས་ བཞི་ གང་ཞེ་ན །_
en: What are these four qualities?

source: འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཁྱིམ་ གྱི་ གནས་ ནས་ མངོན་པར་ བྱུང་བ་ ཡིན །_
en: That such bodhisattvas have gone forth from their household.

source: བས་མཐ འི་ གནས་མལ་ ན་ གནས་ ཤིང་ དགོན་པ་ དང་ རབ་ཏུ་ དགོན་པ་ ལ་ མངོན་པར་ དགའ་བ་ ཡིན །_
en: That they sleep in peripheral areas, delighting in forests and wildernesses.

source: དེ་ སེམས་ཅན་ གྱི་ སྤྱོད་པ་ ལ་ འཇུག་པ་ དག་ ལ་ རྗེས་སུ་ རྣམ་པར་ བལྟས་ ནས་ ཡུལ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ གདམས་ངག་ དང་ རྗེས་སུ་ བསྟན་པ་ སྟོན་པ ར་ བྱེད་པ་ ཡིན །_
en: That they give oral advice and instructions in accordance with the audience, in view of those who engage in the conduct of beings.

source: བྱང་ཆུབ་ སེམས་དཔའ་ མོས་པ་ ཇི་ལྟ་བ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ ཡང་ཡང་ དག་པ ར་ རབ་ཏུ་ ཤེས་པ་ ཡིན་ ནོ །_།
en: Such bodhisattvas also know perfectly well the conduct that accords with their inclinations.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ གཞན་ བཞི་ དང་ ལྡན་པ་ ནི་ དགེ་བ འི་ བཤེས་གཉེན་ དུ་ རིག་པ ར་ བྱ་ སྟེ །_
en: $1955 “Dṛḍhamati, those who have four other qualities should be known as spiritual friends.

source: ཚར་གཅོད་པ འི་ ཚིག་ དང་ ལྡན་པ་ ཉིད་ ཡིན །_
en: They are in possession of expressions that defeat others.

source: ཆོས་ ཟབ་མོ་ ལ་ སྦྱོར་བ ར་ བྱེད་པ་ ཉིད་ [222b] ཡིན །_
en: They connect beings with the profound Dharma. [222.b]

source: དུས་ དུས་ སུ་ གདམས་ངག་ གི་ ཚིག་ དང་ ལྡན་པ་ ཉིད་ ཡིན །_
en: They are in possession of timely expressions of oral advice.

source: དུས་ དུས་ སུ་ ཡལ་བ ར་ འཇོག་པ་ ཉིད་ ཡིན་ ཏེ །_
en: And they let go of those instructions when the time is right.

source: ཆོས་ གཞན་ བཞི་པོ་ དེ་དག་ དང་ ལྡན་པ་ ནི་ དགེ་བ འི་ བཤེས་གཉེན་ དུ་ རིག་པ ར་ བྱ འོ །_།
en: Those who possess those four other qualities should be known as spiritual friends.”

source: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ སྟེ །_
en: $1956 In that regard, the Blessed One then said the following:

source: ས་ དང་ ཕྱོགས་ ནི་ རབ་ ཤེས་ ཤིང་ །_།
en: “Perfectly knowing place and region, And

source: གང་ཟག་ ཀྱང་ ནི་ རབ་ཏུ་ ཤེས །_།
en: perfectly knowing people too,

source: གང་ གིས་ དེ་དག་ མྱུར་ འབྱུང་བ འི །_། གདམས་ངག་ དེ་ ལ་ སྦྱིན་པ ར་ བྱེད །_།
en: Spiritual friends dispense to them oral instructions Through which they will swiftly emerge.

source: དེ་ ལ་ ཚར་ གཅད་ སྨྲ་བྱེད་ ཅིང་ །_། ཟབ་མོ་ ལ་ ཡང་ སྦྱོར་བ ར་ བྱེད །_།
en: $1957 “Spiritual friends speak defeating expressions to beings, And also connect them with the profound.

source: དེ་ ལ་དུ ས་ སུ་ འདོམས་ བྱེད་ ཅིང་ །_། དུས་ སུ་ ཡལ་བ ར་ འཇོག་པ ར་ བྱེད །_།
en: They instruct them in a timely fashion, And let go of those instructions when the time is right.

source: འབྱོར་པ་ ཅི་ཞིག་ སྨྲས་ ཀྱང་ རུང་ །_། |#| ལྷག་པ ར་ གླེང་བ ར་ བྱེད་ ཀྱང་ རུང་ །_།
en: $1958 “Whichever turns of phrase spiritual friends have spoken, Even while conversing intensively,

source: དེ་ ལ་ གཟུང་བ་ ཡོད་ མ་ ཡིན །_། |#| དེ་བ ས་ དུས་ སུ་ ཡལ་བ ར་ འཇོག _།
en: They have no fixation upon them, And thus let go of them when the time is right.

source: བརྟན་པ འི་ བློ་ གྲོས་ ཆོས་ བཞི་ དང་ ལྡན་པ་ ནི་ དགེ་བ འི་ བཤེས་གཉེན་ དུ་ རིག་པ ར་ བྱ་ སྟེ །_
en: $1959 “Dṛḍhamati, those in possession of four qualities should be known as spiritual friends.

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ ལ་ དགེ་བ འི་ བཤེས་གཉེན་ ནི་ མངོན་པར་ འབྱུང་བ་ ལ་ སྦྱོར་ དུ་ འཇུག་པ་ ཡིན་ དོན་ ཟབ་མོ་ ངེས་པ ར་ སེམས་པ་ ལ་ སྦྱོར་ དུ་ འཇུག་པ་ ཡིན །_
en: Dṛḍhamati, spiritual friends cause beings to connect with going forth. |#| They cause them to connect with the intention to ascertain the profound meaning.

source: བསམ་གཏན་ གྱི་ དམིགས་པ་ ཐམས་ཅད་ ལ་མ་ ཆགས་པ་ ཉིད་ ལ་ སྦྱོར་ དུ་ འཇུག་པ་ ཡིན །_
en: They cause beings to connect with non-attachment toward any focal point in concentration.

source: མཚན་མ་ མེད་པ འི་ དམིགས་པ་ ཉིད་ ལ་ སྦྱོར་ དུ་ འཇུག་པ་ ཡིན་ ཏེ །_
en: They also cause beings to connect with the perception of the absence of characteristics.

source: བཞི་པོ་ དེ་དག་ གོ །_།
en: These are the four.”

source: རྣམ་པར་ དབེན་པ འི་ དགོན་གནས་ དང་ །_། མངོན་པར་ འབྱུང་ ལ་ སྦྱོར་ གཞུག་ བྱ །_།
en: “They should cause beings to connect With isolated forests and going forth.

source: དེ་ ཡི་ བསྔགས་པ་ ཀུན་ ཏུ་ སྨྲ །_། |#| དགེ་བ འི་ བཤེས་གཉེན་ དེ་ འདྲ འོ །_།
en: Speaking always in praise of that— Such are spiritual friends.

source: ཟབ་མོ་ ངེས་པ འི་ ཆོས་ རྣམས་ ནི །_། དམ་པ འི་ དོན་ དུ་ སྦྱོར་བ ར་ བྱ །_།
en: $1961 “They should connect beings with teachings ascertained as profound, According to their ultimate meaning, And

source: དེ་ ནི་ བསམ་གཏན་ རྣམས་ མི་ སྟོང་ །_།
en: they should not be devoid of concentrations—

source: དེ་དག་ བཤེས་གཉེན་ རབ་ བཟང་ ཡིན །_།
en: Those are sublime spiritual friends.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ བཞི་ དང་ ལྡན་ ན །_ |#| ཏིང་ངེ་འཛིན་ དེ་ བསྒོམ་པ ར་ ནུས་ ཏེ །_
en: $1962 “Dṛḍhamati, there are four qualities which, if bodhisattvas possess them, enable them to cultivate that absorption.

source: རང་ གི་ བློ་ བོར་ ནས་
en: Having discarded their own intellect,

source: སློབ་དཔོན་ གྱི་ བློས་ འགྲོ་བ ར་ བྱ་བ་ ཡིན །_
en: bodhisattvas should be moved according to the intellect of the master.

source: བརྩོན་འགྲུས་ ཡོངས་སུ་ ཆད་པ ས་ མི་ བརྩམ་པ ར་ བྱ་བ་ ཡིན །_
en: They should apply diligence uninterruptedly.

source: བརྩོན་པ་ མི་ གཏོང་བ་ དང་ །_ དགོན་པ་ དང་ །_ རབ་ཏུ་ དགོན་པ་ ལ་ མངོན་པར་ དགའ་བ ར་ བྱ་བ་ ཡིན །_
en: They should not discard diligence and should delight in forests and wildernesses.

source: བྲེ་མོ་ གཏམ་ ཐམས་ཅད་ ཡོངས་སུ་ སྤང་བ ར་ བྱ་བ་ ཡིན་ ཏེ །_
en: They should fully abandon all social interactions.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ བཞི་པོ་ དེ་དག་ དང་ ལྡན་པ འི་ བྱང་ཆུབ་ སེམས་དཔ ས་ ནི་ ཏིང་ངེ་འཛིན་ དེ་ ཐོབ་པ ར་ ནུས་ སོ །_།
en: Dṛḍhamati, bodhisattvas who have these four qualities will be able to attain that absorption.

source: བརྟན་པ འི་ བློ་གྲོས་ གཞན་ ཡང་ ཆོས་ བཞི་ དང་ ལྡན་ ན །_ |#| ཏིང་ངེ་འཛིན་ དེ་ ཐོབ་པ ར་ ནུས་ ཏེ །_
en: $1963 “Dṛḍhamati, there are four other qualities which, if bodhisattvas possess them, enable them to attain that absorption.

source: ལེགས་པ ར་ བཟུང་བ འི་ དེ་བཞིན་ གཤེགས་པ་ ལ་ དམིགས་པ ས་ ཐ་ན་ རྨི་ལམ་ དུ་ རྨི་བ་ ལ་ གནས་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ མི་ སྤོང་བ་ ཡིན །_
en: In perceiving thus-gone ones that they uphold well, they do not abandon the thus-gone ones even while so much as dreaming of them.

source: ལེགས་པ ར་ བཟུང་བ འི་ ཆོས་ བསྟན་པ་ ལ་ དམིགས་པ ས་ ཐ་ན་ རྨི་ལམ་ དུ་ རྨི་བ་ ལ་ གནས་ ཀྱང་ ཆོས་ བསྟན་པ་ ལ་ དམིགས་པ་ མི་ སྤོང་བ་ ཡིན་ [223a] ཞིང་ ཆོས་ བསྟན་པ་ ལ་ སྙོམ་ལས་ མེད་པ་ ཡང་ ཡིན །_
en: In perceiving Dharma teachings that they uphold well, they do not discard the perception of the Dharma teachings even while so much as dreaming of them, and neither are they apathetic about Dharma teachings. [223.a]

source: དངོས་པོ་ ཐམས་ཅད་ རྣམ་པར་ འཇིག་པ་ ཉིད་ ཀྱིས་ ཆོས་ ཟབ་མོ་ ལ་ བཟོད་པ་ ཐོབ་པ་ ཡང་ ཡིན །_
en: Through the perishability of all things, they also acquire acceptance of the profound Dharma.

source: དབེན་པ་ ལ་ གཞོལ་བ་ ཉིད་ ཀྱིས་ མི་ གནས་པ འི་ བསམ་གཏན་པ་ ཡང་ ཡིན་ ཏེ །_
en: Through practicing disengagement, they are also those who practice the concentration of non-abiding.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ བཞི་པོ་ དེ་དག་ དང་ ལྡན་པ འི་ བྱང་ཆུབ་ སེམས་ དཔ ས་ ནི་ ཏིང་ངེ་འཛིན་ དེ་ ཐོབ་པ ར་ ནུས་ སོ །_།
en: Dṛḍhamati, bodhisattvas who have those four qualities will be able to attain that absorption.”

source: གལ་ཏེ་ དགེ་བ འི་ བཤེས་གཉེན་ གྱིས །_། འདི་ལྟར་ རྗེས་སུ་ འཐུན་ འདོམས་ བྱེད །_། |#| སངས་རྒྱས་ རྣམས་ ཀྱིས་ བགྲོད་བྱ་བ །_། དེ་ མི་ སྤོང་བ ར་ ང་ སྨྲ འོ །_།
en: “If a spiritual friend Should instruct in accordance with this, The path traversed by the buddhas, It should not be abandoned, I say.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ བཞི་ དང་ ལྡན་པ་ ནི་ དགེ་བ འི་ བཤེས་གཉེན་ དུ་ རིག་པ ར་ བྱ་ སྟེ །_
en: $1965 “Dṛḍhamati, those who possess four qualities should be known as spiritual friends.

source: དགེ་ བ་ ལ་ སྦྱོར་བ ར་ བྱེད་པ་ ཉིད་ ཡིན །_
en: They connect beings with virtue.

source: སྡིག་པ་ ལས་ ཟློག་པ ར་ བྱེད་པ་ ཉིད་ ཡིན །_
en: They turn them away from wickedness.

source: ཆོས་ ལ་ ཡང་ རབ་ཏུ་ གཞོག་པ ར་ བྱེད་པ་ ཡིན །_
en: They bring them to the Dharma.

source: རྗེས་སུ་ འཐུན་པ འི་ རྗེས་སུ་ བསྟན་པ་ ཡང་ སྦྱིན་པ ར་ བྱེད་པ་ ཡིན་ ཏེ །_
en: And they give teachings appropriate to them.

source: དགེ་བ འི་ བཤེས་གཉེན་ རྟག་ ཏུ་ བསྟེན་པ ར་ བྱ །_།
en: “Bodhisattvas should always rely on spiritual friends.

source: གང་དག་ སྡིག་པ འི་ ཆོས་ རྣམས་ ཟློག་ བྱེད་ ཅིང་ །_། རྒྱལ་བས་ གནང་བ འི་ ཆོས་ ནི་ སྟོན་ བྱེད་པ །_། སྐྱེས་མཆོག་ དེ་ འདྲ་ དེ་དག་ བསྟེན་པ ར་ བྱ །_།
en: They should rely on such supreme persons, Who turn beings away from wicked qualities, And teach the Dharma given by the victorious ones.

source: གང་ ལས་ ཆོས་ ནི་ འབྱུང་བ ར་ འགྱུར་བ་ ཡི །_། དཔའ་བོ་ དག་ ནི་ རྗེས་ འཐུན་ གདམས་ངག་ སྦྱིན །_།
en: $1967 “The heroes from whom the Dharma originates Dispense appropriate oral instructions.

source: ཇི་ལྟ ར་ བསྟན་པ་ བཞིན་ དུ་ ཆོས་ ལ་ གནས །_།
en: They abide by the Dharma, precisely as it is taught, And

source: ཆོས་ ལ་ གནས་ ནས་ ཀྱང་ ནི་ ཁྱད་པར་ འགྲོ །_།
en: based on abiding by the Dharma, they progress.

source: གང་དག་ བསྟེན་པ ར་ བྱ་བ འི་ ཆོས་ རྣམས་ སྟེན །_།
en: $1968 “They rely upon the teachings that should be relied upon.

source: གང་དག་ བསྟེན་པ ར་ བྱ་བ འི་ ཆོས་ རྣམས་ ཤེས །_།
en: They know the teachings that should be relied upon.

source: རྣམ་པར་ སྤང་བ ར་ བྱ་བ འང་ རྣམ་ སྤངས་ ནས །_།
en: Having also abandoned what should be abandoned,

source: རྒྱལ་བས་ གནང་བ འི་ ཆོས་ རྣམས་ སྟེན་པ ར་ བྱེད །_།
en: They rely on the teachings given by the victorious ones.

source: རང་ གི་ ཤེས་པ ས་ རབ་ཏུ་ བསྟན་པ འི་ ཕྱིར །_། བྱང་ཆུབ་ སེམས་དཔའ་ གང་ཞིག་ སྤོབས་ འདོད་པ ས །_། ཏིང་འཛིན་ དེ་ ནི་ མྱུར་ དུ་ བསྒོམ་པ ར་ བྱ །_། |#| དགེ་བ འི་ བཤེས་གཉེན་ རྗེས་སུ་ འབྲང་བ ར་ བྱ །_།
en: $1969 “Bodhisattvas who want eloquence In order to teach from their own knowledge Should quickly cultivate that absorption And follow a spiritual friend.

source: ཇི་ལྟ ར་ བསྟན་ པ་ བཞིན་ དུ་ ཡོངས་སུ་ སྤང་ །_། |#| ཆོས་ ནི་ གང་ཡང་ རྣམ་པར་ སྤང་ མི་ བྱ །_།
en: $1970 “They should renounce entirely, precisely as taught, But should not discard any phenomena whatsoever.

source: ཆོས་ གང་ ཁོ་ན་ ཐོབ་པ ར་ འགྱུར་བ་ ཡི །_། དེ་ཉིད་ ཕན་པ འི་ དོན་ དུ་ བསྟན་པ ར་ བྱ །_།
en: They should teach for the sake of benefiting Precisely those who will receive the Dharma.

source: བསམ་པ་ ཐམས་ཅད་ ཀྱིས་ ནི་ བསྒྲུབ་པ ར་ བྱ །_། |#| དེ་ ཡིས་ གཡོ་ ནི་ ངེས་པ ར་ བསྟན་ མི་ བྱ །_།
en: $1971 “They should accomplish their wishes in all respects, But should certainly not teach moved by them.

source: དགེ་བ འི་ བཤེས་གཉེན་ རྟག་ ཏུ་ བསྟེན་པ་ ཡིས །_། དེ་ འདྲ འི་ ཆོས་ དེ་དོན་ དུ་ གཉེར་བ ར་ བྱ །_།
en: Bodhisattvas should seek such teachings In reliance always upon a spiritual friend.

source: དེ་ཕྱིར་ དགེ་བ འི་ བཤེས་གཉེན་ བསྟེན་པ ར་ བྱ །_།
en: $1972 “Therefore, bodhisattvas should rely upon spiritual friends.

source: སྡིག་པ འི་ གྲོགས་པོ་ ཡོངས་སུ་ སྤང་བ ར་ བྱ །_།
en: They should abandon wicked companions.

source: དགེ་བ འི་ བཤེས་གཉེན་ ལས་ ནི་ ཐོས་པ་ འབྱུང་ །_།
en: They will become learned based on spiritual friends, And

source: དེ་ལས་ ཏིང་འཛིན་ དེ་ཡང་ མྱུར་ དུ་ འཐོབ །_།
en: based on them, they will also quickly attain that absorption.

source: བརྟན་པ འི་ བློ་གྲོས་ གཞན་ ཡང་ ཆོས་ བཞི་ དང་ ལྡན་པ འི་ དགེ་བ འི་ བཤེས་གཉེན་ ནི་ བསྟེན་པ ར་ བྱ་བ་ ཡིན་ ཏེ །_
en: $1973 “Dṛḍhamati, bodhisattvas should rely upon spiritual friends with four qualities.

source: གདམས་ངག་ ཀྱང་ རབ་ཏུ་ ཤེས་པ་ [223b] ཡིན །_།
en: They fully know the oral instructions. [223.b]

source: བསྒོམ་པ་ ཡང་ རབ་ཏུ་ ཤེས་པ་ ཡིན །_
en: They fully know their cultivation.

source: གདམས་ངག་ གི་ སྐྱོན་ ཡང་ རབ་ཏུ་ ཤེས་པ་ ཡིན །_
en: They fully know the faults with oral instructions.

source: བསྒོམ་པ འི་ སྐྱོན་ ཡང་ རབ་ཏུ་ ཤེས་པ་ ཡིན་ ཏེ །_
en: And they fully know the faults with their cultivation.

source: གདམས་ངག་ དང་ ནི་ དེ་བཞིན་ བསྒོམ་པ འང་ ཤེས །_།
en: “They know oral instructions, and likewise, cultivation.

source: དེ་ ལ་ དེ་བཞིན་ བསྒོམ་པ འི་ སྐྱོན་ དང་ ནི །_། གདམས་ངག་ སྐྱོན་ ཡང་ རབ་ཏུ་ ཤེས་ ནས་ སུ །_། སྐྱོན་མེད་ ཆོས་ ཀྱིས་ སྦྱོར་བ ར་ བྱེད་པ་ ཡིན །_།
en: They also fully know the faults with cultivation, And the faults with oral instructions, And thus connect beings with the faultless Dharma.

source: བཞི་ གང་ཞེ་ན །_ འདི་ལྟ་སྟེ །_
en: What are those four qualities?

source: ས་ ཡང་ རབ་ཏུ་ ཤེས་པ་ ཡིན །_
en: They fully know place.

source: ཡུལ་ ཡང་ རབ་ཏུ་ ཤེས་པ་ ཡིན །_
en: They fully know location.

source: གང་ཟག་ ཀྱང་ རབ་ཏུ་ ཤེས་པ་ ཡིན །_
en: They fully know persons.

source: སྤྱོད་པ་ ཡང་ རབ་ཏུ་ ཤེས་པ་ ཡིན་ ནོ །_།
en: And they fully know conduct.

source: ཇི་ལྟ ར་ ས་རབ་ ཏུ་ ཤེས་པ་ ཡིན་ ཞེ་ན །_
en: $1976 “How is it that they fully know place?

source: གང་ཟག་ དང་ འཚམ་པ ས་ ས་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ ཤེས་པ འོ །_།
en: They fully and precisely know place in accordance with persons.

source: ཇི་ལྟ ར་ གང་ཟག་ རབ་ཏུ་ ཤེས་པ་ ཡིན་ ཞེ་ན །_
en: How is it that they fully know persons?

source: སྤྱད་པ ས་ གང་ཟག་ ཏུ་ འགྱུར་བ་ ཇི་ལྟ་བ་ དེ་བཞིན་ དུ་ རབ་ཏུ་ ཤེས་པ འོ །_།
en: They fully and precisely know what persons will become based on their conduct.

source: ཇི་ལྟ ར་ སྤྱོད་པ་ རབ་ཏུ་ ཤེས་པ་ ཡིན་ ཞེ་ན །_
en: How is it that they fully know conduct?

source: འདོད་ཆགས་ དང་ །_ ཞེ་སྡང་ དང་ །_ གཏི་ མུག་ གི་ སྤྱོད་པ་ དང་ རྗེས་སུ་ འཐུན་པ འི་ ཆོས་ བསྟན་པ་ ལ་ འཇུག་པ་ ངེས་པ ར་ བསྟན་པ ས་ ནི་ ཆགས་པ་ རྣམ་པར་ སྤོང་བ་ ཉིད་ ཀྱི་ ཕྱིར་ ཆོས་གོས་ གསུམ་ ལྷུར་ལེན་པ་ ཡིན །_ |#| རབ་ཏུ་ བྱུང་བ་ དང་ །_ ཁྱིམ་པ་ དག་ དང་ ལྷན་ཅིག་ མ་ འདྲེས་པ་ ཡིན་ ཞིང་ །_ རྩོད་པ་ རྣམ་པར་ སྤོང་བ་ དང་ །_ ཟབ་མོ་ ལ་ བཟོད་པ་ དང་ །_ སྟོང་པ་ཉིད་ ཀྱི་ སྤྱོད་ཡུལ་བ་ ཡིན་ ཏེ །_
en: They decisively demonstrate engagement in Dharma teachings in accordance with desirous, hateful, and delusional conduct. |#| Thereby, in order to abandon desire, they enthusiastically embrace the three Dharma robes and go forth, do not associate with householders, abandon argumentation, accept the profound, and experience emptiness.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ བཞི་པོ་ དེ་དག་ དང་ ལྡན་པ་ ནི་ ཏིང་ངེ་འཛིན་ དེ་ ཐོབ་པ ར་ འགྱུར་བ འི་ དགེ་བ འི་ བཤེས་གཉེན་ དུ་ རིག་པ ར་ བྱ འོ །_།
en: Dṛḍhamati, those with those four qualities should be known as spiritual friends who will attain that absorption.

source: བརྟན་པ འི་ བློ་གྲོས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཁྱིམ་པ་ ཆོས་ བཞི་ དང་ ལྡན་ ན་ ཏིང་ངེ་འཛིན་ དེ་ ཐོབ་པ ར་ བྱ་བ་ དང་ །_ ཏིང་ངེ་འཛིན་ དེ་ ལ་ མངོན་པར་ བརྩོན་པ ར་ ནུས་ ཏེ །_
en: $1977 “Dṛḍhamati, there are four qualities that, if householder bodhisattvas possess them, enable them to attain that absorption and strive in that absorption.

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཁྱིམ་པ ས་ ནི་ བསླབ་པ འི་ གཞི་ལྔ་ གཟུང་བ ར་ བྱ་བ་ ཡིན །_
en: Dṛḍhamati, householder bodhisattvas should observe the five precepts.

source: ཟ་ གཅིག་པ་ ལྷུར་ལེན་ པས་ གཙུག་ལག་ཁང་ དུ་ གནས་པ ར་ ཡང་ བྱ་བ་ ཡིན །_
en: They should also stay in a monastic rest house, taking only one meal a day.

source: མང་ དུ་ ཐོས་པ ར་ ཡང་ བྱ་བ་ ཡིན །_
en: They should become highly learned.

source: དོན་ རྣམ་པར་ ངེས་པ་ ལ་ མཁས་པ་ དང་ །_ གང་དག་ ཏིང་ངེ་འཛིན་ དེ་ ལ་ གནས་ ནས་ འདོམས་པ ར་ བྱེད་པ འི་ དགེ་ བ འི་ བཤེས་གཉེན་ ལ་ བསྟེན་པ ར་ བྱ་བ་ ཡིན་ ཏེ །_
en: They should become adept at ascertaining the meaning and rely upon spiritual friends who instruct while abiding in that absorption.

source: བརྟན་པ འི་ བློ་གྲོས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཁྱིམ་པ་ ཆོས་ བཞི་པོ་ དེ་དག་ དང་ ལྡན་ ན་ ཏིང་ངེ་འཛིན་ དེ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ སྦྱོར་བ ར་ བྱ འོ །_།
en: Dṛḍhamati, if householder bodhisattvas have those four qualities, they should apply themselves to attaining that absorption.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ གཞན་ བཞི་ དང་ ལྡན་པ ས་ སྦྱོར་བ ར་ བྱ་ སྟེ །_
en: $1978 “Dṛḍhamati, bodhisattvas should apply themselves to it by having four other qualities.

source: ཆོས་ ཐམས་ཅད་ ལ་ མི་ གནས་པ ས་ ཏིང་ངེ་འཛིན་ དེ་ ཐོབ་པ ར་ བྱ་ [224a] བ འི་ ཕྱིར་ ཚུལ་ཁྲིམས་ ཀྱི་ ཕུང་པོ་ ཡོངས་སུ་ དག་པ་ དང་ །_ འཚོ་བ་ ཡོངས་སུ་ དག་པ་ དང་ །_ འགྱོད་པ་ མེད་པར་ གྱུར་ ནས་ |#| ལུས་ དང་ སྲོག་ ལ་ ཡང་ མི་ལྟ་བ ར་ བྱ་བ་ ཡིན །_
en: In order to bring about the attainment of that meditative concentration through not dwelling on any phenomenon, they should have a pristine practice of discipline, a pristine livelihood, and disregard their life and limb without any remorse.
